#pragma once

#include "../../Global/Define/KDefine+Global.h"

/*
* C 연습 문제 12
* - 다양한 모양 출력하기
* - 라인 수를 입력 받아 해당 라인만큼 다양한 모양 출력하기
*
* Ex)
* 라인 수 입력 : 5
* *   *
*  * *
*   *
*  * *
* *   *
*
* *****
*    *
*   *
*  *
* *****
*
* *   *
* **  *
* * * *
* *  **
* *   *
*
* *
* **
* ***
* ****
* *****
*
* *****
* ****
* ***
* **
* *
*
*     *
*    **
*   ***
*  ****
* *****
*
* *****
*  ****
*   ***
*    **
*     *
*
*     *
*    ***
*   *****
*  *******
* *********
*
* *********
*  *******
*   *****
*    ***
*     *
*/

/** Training 12 */
int T01Training_12(int argc, char* args[]);
