#pragma once

#include "../../Global/Define/KDefine+Global.h"

/*
* C 연습 문제 11
* - 구구단 출력하기
* - 2 단부터 9 단까지 구구단을 출력한다
* - 단, 1 줄에 3 단씩 구구단을 출력한다
*
* Ex)
* 2 * 1 = 2		3 * 1 = 3		4 * 1 = 4
* 2 * 2 = 4		3 * 2 = 6		4 * 2 = 8
* 2 * 3 = 6		3 * 3 = 9		4 * 3 = 12
* ...이하 생략
*
* 5 * 1 = 5		6 * 1 = 6		7 * 1 = 7
* 5 * 2 = 10	6 * 2 = 12		7 * 2 = 14
* 5 * 3 = 15	6 * 3 = 18		7 * 3 = 21
* ...이하 생략
*
* 8 * 1 = 8		9 * 1 = 9
* 8 * 2 = 16	9 * 2 = 18
* 8 * 3 = 24	9 * 3 = 27
* ...이하 생략
*/

/** Training 11 */
int T01Training_11(int argc, char* args[]);
